<template>
    <div class="agreement-wrapper">
        <div class="logo-title">
            <img src="~@/assets/img/logo.png">
            <div>易码商城</div>
        </div>
        <div class="agree-title">商户入驻协议</div>
        <div style="padding: 0 100px; white-space: pre-wrap; line-height: 26px;">
          欢迎您注册易码商城账号并使用易码微信小程序服务！
          本《易码商城平台用户服务协议》（以下简称“本服务协议”）是您与易码商城之间就注册易码商城用户账号及使用易码商城的各项服务等相关事宜所订立的协议。为使用易码商城的服务，您应当仔细阅读并遵守本服务协议下的全部内容，特别是涉及免除或者责任限制的条款。除非您已阅读并接受本服务协议所有条款，否则您将不能注册易码商城账号或使用易码商城的服务，如您不同意本服务条款的任意内容，请勿注册或使用易码商城的服务，并应立即停止注册程序。如您对本服务协议的内容（特别是涉及免除或者责任限制的条款）有任何疑义，可随时与商场联系，我们将根据商场反馈给我们您的要求为您进一步解释和说明相关内容。如您勾选“我同意《易码商城平台用户服务协议》”并通过注册程序或其他任何方式使用或接受易码商城的任何服务，即视为您已阅读并同意本服务协议，自愿接受本服务协议的所有内容的约束。请您在决定注册或使用服务前再次确认您已知悉并完全理解本服务协议的所有内容。
          本服务协议所述“服务”既包括您使用易码商城用户账号接受易码商城平台相关商家、个人所提供的服务，亦包括在某些特定的业务类别下您使用易码商城用户账号向其他商家、个人或其他主体提供服务的情形。无论“服务”属于上述何种情形，本《易码商城平台用户服务协议》都将予以适用，如有任何疑问、帮助及要求，可直接联系所在商场管理人员或易码商城平台工作人员。
          我们会出于本政策所述的以下目的，收集和使用您的个人信息：
          （一）帮助您登录我们的商家版后台
          为登录我们的商家版后台，以便我们为您提供商家服务，您需要提供手机号码，角色信息，网络身份识别信息（头像、昵称及账号密码）。
          （二）更好的为您提供产品\服务
          1、您向我们提供的信息
          为便于向您提供产品\服务，我们有权从身份校验、完成交易、售后及客户服务、提供安全保障的多种角度，收集您向我们提供的联系人信息（姓名、性别、电话号码）、法定代表人信息（姓名、手机号、身份证号、自愿选择提供的银行卡号）、收货地址、电子邮箱、银行账户或其他支付工具的账户信息，您在使用易码商城商家版服务的过程中所提交的任何文字、照片、视频各种形式的信息，也可能会包含或者关联到您的个人信息，我们将对于上述信息中涉及的个人信息予以严格保护。
          2、我们在您使用服务过程中收集的信息
          为向您展示有关订单信息，我们会收集您在使用我们服务过程中产生的订单信息用于向您展示及便于您对订单进行管理。
          为了满足法律法规及提供服务的基本要求，保障您的账号安全与系统运行安全以及更好的使用我们的产品，提升产品问题排查效率，我们会收集您的日志信息、订单信息、浏览及搜索信息、位置信息、设备信息、行为偏好，问题上报描述，联系电话以及您在使用服务过程中所提交的任何文字、照片、视频信息并将您在使用我们关联方的某项服务中提供的信息结合起来，进行综合统计、分析以形成用户画像，用来向您推荐或展示您可能感兴趣的产品\服务信息；
          3、当您与我们联系时，我们可能会收集您的通信\通话记录和内容或您留下的联系方式信息，以便与您联系、帮助您解决问题，或记录相关问题的处理方案及结果。
          4、当您参与我们的推广活动和问卷调查过程中，我们可能会收集您主动提供的相关信息。
          5、受网络状态稳定性等限制，极端情况下，可能会出现易码商城小程序商城无法正常使用，如遇此类情形，平台无需承担责任。
          6、我们通过间接收集到的您的个人信息
          为能向您提供更优质的服务，同时为能确认交易状态及为您提供售后与争议解决服务，经您授权后我们会通过您选择的交易对象和交易直接涉及的第三方信息系统、支付机构等收集与交易进度相关的您的交易、支付、配送信息，或者将您的信息共享给上述服务提供者，以便于我们处理您的订单并保证服务的顺利完成，或者更好地预防诈骗、刷单等恶意行为。我们会依据法律法规的要求以及与第三方的约定，经您授权后向易码商城的关联方、合作伙伴获得您的有关信息，并对其信息来源的合法性进行确认后使用您的这些信息。
          我们承诺将对于上述信息中涉及的个人信息予以严格保护。
          请注意，无法与任何特定个人直接建立联系的数据，不属于个人信息。
          （三）改进我们的产品\服务
          为改善我们的产品或服务、向您提供个性化的信息搜索及交易服务，使您及时了解丰富的商品信息，提升服务体验，我们会根据您的浏览及搜索记录、设备信息、位置信息、订单信息，提取您的浏览、搜索偏好、行为习惯、位置信息特征，基于特征标签进行间接人群画像并展示、推送相关信息，包括通过短信、电话、邮件、线上展示各种方式向你推送营销活动信息、商品交易信息、促销信息、调研问卷。如果您不同意接收来自平台的推送信息，可以通过相应的退订方式进行退订。
          （四）为您提供安全保障
          为了保障您的账号安全、交易安全以及系统运行安全，满足法律法规和我们协议规则的相关要求，在您使用我们的产品/服务过程中，经您授权我们会获取您的设备信息，包括您使用的设备属性、连接和状态信息，例如设备型号、唯一设备标识符、设备MAC地址、软件列表、电信运营商等。
          为提高您使用我们提供的服务的安全性，更准确地预防钓鱼网站欺诈和木马病毒，我们可能会使用或整合您的个人信息以及我们的关联方、合作伙伴取得您授权或者依法共享的信息，根据您的使用习惯和常用软件信息来综合判断您的账号及交易风险，包括验证身份，预防、发现、调查可能存在的欺诈、网络病毒、网络攻击的安全风险以及违反我们或关联方协议、政策或规则的行为，以保护您、其他用户、我们或关联方的合法权益，并记录一些我们认为有风险的链接。
          （五）征得同意的例外
          请您知悉，以下情形中，我们收集、使用个人信息无需征得您的授权同意：
          1、与国家安全、国防安全有关的；
          2、与公共安全、公共卫生、重大公共利益有关的；
          3、与犯罪侦查、起诉、审判和判决执行等有关的；
          4、出于维护个人信息主体或其他个人的生命、财产等重大合法权益但又很难得到本人同意的；
          5、所收集的个人信息是个人信息主体自行向社会公众公开的；
          6、从合法公开披露的信息中收集的您的个人信息的，如合法的新闻报道、政府信息公开等渠道；
          7、根据您的要求签订合同所必需的；
          8、用于维护所提供的产品与/或服务的安全稳定运行所必需的，例如发现、处置产品与/或服务的故障；
          9、为合法的新闻报道所必需的；
          10、学术研究机构基于公共利益开展统计或学术研究所必要，且对外提供学术研究或描述的结果时，对结果中所包含的个人信息进行去标识化处理的；
          11、法律法规规定的其他情形。
          （六）我们保护您个人信息的安全
          为保障您的信息安全，我们努力采取各种符合业界标准的物理、电子和管理方面的安全措施来保护您的个人信息，防止您的个人信息遭到未经授权访问、公开披露、使用、修改、损坏或丢失。我们会采取一切合理可行的措施，保护您的个人信息，使用加密技术确保数据的保密性；使用受信赖的保护机制防止数据遭到恶意攻击；部署访问控制机制，确保只有授权人员才可访问个人信息；以及举办安全和隐私保护培训课程，加强员工对于保护个人信息重要性的认识。
          在不幸发生个人信息安全事件后，我们将按照法律法规的要求，及时向您告知：安全事件的基本情况和可能的影响、我们已采取或将要采取的处置措施、您可自主防范和降低风险的建议、对您的补救措施等。我们将及时将事件相关情况以邮件、信函、电话、推送通知等方式告知您，难以逐一告知个人信息主体时，我们会采取合理、有效的方式发布公告。同时，我们还将按照监管部门要求，主动上报个人信息安全事件的处置情况。
          （七）您如何管理您的个人信息
          您对您的个人信息享有以下权利:
          1、您有权访问、更正、删除您的个人信息，法律法规规定的例外情况除外。您可以通过以下方式管理您的信息:
          账户信息——您可以访问、更正您账户中的个人资料及账号信息（如手机号，也可以更改您的密码），您可以通过访问易码商城商家版在[我的]---[当前账号]中执行此类操作。
          地址信息——您可以通过访问易码商城商家版页面上的[我的]---[门店设置]---[地址]中随时更改您的商家地址。
          如果您无法通过上述链接管理这些个人信息，您可以随时通过本隐私政策中提供的反馈方式联系我们。我们将在15天内回复您的访问请求。
          （八）通知与修订
          为给您提供更好的服务，我们的业务将不时变化，本隐私政策也将随之调整。未经您明确同意，我们不会削减您依据本隐私政策所应享有的权利。我们会通过在我们网站、移动端上发出更新版本或以其他方式提醒您相关内容的更新，也请您访问我们以便及时了解最新的隐私政策。在前述情况下，若您继续使用我们的服务，即表示同意接受修订后的本政策并受之约束。
          （九）如何联系我们
          如果您对于我们的个人信息处理行为存在任何投诉举报需求，请您联系所在商场管理人员。
          您还可以通过易码商城小程序提供的联系方式\客服系统与我们联系并作充分描述，我们将在验证您身份的15天内答复您的请求并尽力解决。如果您对我们的回复不满意，特别是认为我们的个人信息处理行为损害了您的合法权益，您还可以通过向被告住所地有管辖权的法院提起诉讼。
        </div>
    </div>
</template>

<script>
export default {
    
}
</script>

<style lang="scss" scoped>
.logo-title{
    padding: 25px 0;
    display: flex;
    box-shadow: 0 2px 5px 0 rgba(0,0,0,.1);
    img{
        margin-left: 100px;
        height: 35px;
    }
    div{
        color: #333;
        font-size: 32px;
        margin-left: 5px;
    }
}
.agree-title{
    font-size: 20px;
    text-align: center;
    padding: 10px 0;
}
</style>